espressif/esp-idf/components/soc/esp32c6/register/soc/i2s_reg.h
/** I2S_TX_TDM_CTRL_REG register
 *  I2S TX TDM mode control register
 */
#define I2S_TX_TDM_CTRL_REG(i) (REG_I2S_BASE(i) + 0x54)
/** I2S_TX_TDM_CHAN0_EN : R/W; bitpos: [0]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN0_EN    (BIT(0))
#define I2S_TX_TDM_CHAN0_EN_M  (I2S_TX_TDM_CHAN0_EN_V << I2S_TX_TDM_CHAN0_EN_S)
#define I2S_TX_TDM_CHAN0_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN0_EN_S  0
/** I2S_TX_TDM_CHAN1_EN : R/W; bitpos: [1]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN1_EN    (BIT(1))
#define I2S_TX_TDM_CHAN1_EN_M  (I2S_TX_TDM_CHAN1_EN_V << I2S_TX_TDM_CHAN1_EN_S)
#define I2S_TX_TDM_CHAN1_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN1_EN_S  1
/** I2S_TX_TDM_CHAN2_EN : R/W; bitpos: [2]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN2_EN    (BIT(2))
#define I2S_TX_TDM_CHAN2_EN_M  (I2S_TX_TDM_CHAN2_EN_V << I2S_TX_TDM_CHAN2_EN_S)
#define I2S_TX_TDM_CHAN2_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN2_EN_S  2
/** I2S_TX_TDM_CHAN3_EN : R/W; bitpos: [3]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN3_EN    (BIT(3))
#define I2S_TX_TDM_CHAN3_EN_M  (I2S_TX_TDM_CHAN3_EN_V << I2S_TX_TDM_CHAN3_EN_S)
#define I2S_TX_TDM_CHAN3_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN3_EN_S  3
/** I2S_TX_TDM_CHAN4_EN : R/W; bitpos: [4]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN4_EN    (BIT(4))
#define I2S_TX_TDM_CHAN4_EN_M  (I2S_TX_TDM_CHAN4_EN_V << I2S_TX_TDM_CHAN4_EN_S)
#define I2S_TX_TDM_CHAN4_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN4_EN_S  4
/** I2S_TX_TDM_CHAN5_EN : R/W; bitpos: [5]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN5_EN    (BIT(5))
#define I2S_TX_TDM_CHAN5_EN_M  (I2S_TX_TDM_CHAN5_EN_V << I2S_TX_TDM_CHAN5_EN_S)
#define I2S_TX_TDM_CHAN5_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN5_EN_S  5
/** I2S_TX_TDM_CHAN6_EN : R/W; bitpos: [6]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN6_EN    (BIT(6))
#define I2S_TX_TDM_CHAN6_EN_M  (I2S_TX_TDM_CHAN6_EN_V << I2S_TX_TDM_CHAN6_EN_S)
#define I2S_TX_TDM_CHAN6_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN6_EN_S  6
/** I2S_TX_TDM_CHAN7_EN : R/W; bitpos: [7]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN7_EN    (BIT(7))
#define I2S_TX_TDM_CHAN7_EN_M  (I2S_TX_TDM_CHAN7_EN_V << I2S_TX_TDM_CHAN7_EN_S)
#define I2S_TX_TDM_CHAN7_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN7_EN_S  7
/** I2S_TX_TDM_CHAN8_EN : R/W; bitpos: [8]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN8_EN    (BIT(8))
#define I2S_TX_TDM_CHAN8_EN_M  (I2S_TX_TDM_CHAN8_EN_V << I2S_TX_TDM_CHAN8_EN_S)
#define I2S_TX_TDM_CHAN8_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN8_EN_S  8
/** I2S_TX_TDM_CHAN9_EN : R/W; bitpos: [9]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN9_EN    (BIT(9))
#define I2S_TX_TDM_CHAN9_EN_M  (I2S_TX_TDM_CHAN9_EN_V << I2S_TX_TDM_CHAN9_EN_S)
#define I2S_TX_TDM_CHAN9_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN9_EN_S  9
/** I2S_TX_TDM_CHAN10_EN : R/W; bitpos: [10]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN10_EN    (BIT(10))
#define I2S_TX_TDM_CHAN10_EN_M  (I2S_TX_TDM_CHAN10_EN_V << I2S_TX_TDM_CHAN10_EN_S)
#define I2S_TX_TDM_CHAN10_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN10_EN_S  10
/** I2S_TX_TDM_CHAN11_EN : R/W; bitpos: [11]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN11_EN    (BIT(11))
#define I2S_TX_TDM_CHAN11_EN_M  (I2S_TX_TDM_CHAN11_EN_V << I2S_TX_TDM_CHAN11_EN_S)
#define I2S_TX_TDM_CHAN11_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN11_EN_S  11
/** I2S_TX_TDM_CHAN12_EN : R/W; bitpos: [12]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN12_EN    (BIT(12))
#define I2S_TX_TDM_CHAN12_EN_M  (I2S_TX_TDM_CHAN12_EN_V << I2S_TX_TDM_CHAN12_EN_S)
#define I2S_TX_TDM_CHAN12_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN12_EN_S  12
/** I2S_TX_TDM_CHAN13_EN : R/W; bitpos: [13]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN13_EN    (BIT(13))
#define I2S_TX_TDM_CHAN13_EN_M  (I2S_TX_TDM_CHAN13_EN_V << I2S_TX_TDM_CHAN13_EN_S)
#define I2S_TX_TDM_CHAN13_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN13_EN_S  13
/** I2S_TX_TDM_CHAN14_EN : R/W; bitpos: [14]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN14_EN    (BIT(14))
#define I2S_TX_TDM_CHAN14_EN_M  (I2S_TX_TDM_CHAN14_EN_V << I2S_TX_TDM_CHAN14_EN_S)
#define I2S_TX_TDM_CHAN14_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN14_EN_S  14
/** I2S_TX_TDM_CHAN15_EN : R/W; bitpos: [15]; default: 1;
 *  1: Enable the valid data output of I2S TX TDM channel $n. 0:  Disable, just output
 *  0 in this channel.
 */
#define I2S_TX_TDM_CHAN15_EN    (BIT(15))
#define I2S_TX_TDM_CHAN15_EN_M  (I2S_TX_TDM_CHAN15_EN_V << I2S_TX_TDM_CHAN15_EN_S)
#define I2S_TX_TDM_CHAN15_EN_V  0x00000001U
#define I2S_TX_TDM_CHAN15_EN_S  15
/** I2S_TX_TDM_TOT_CHAN_NUM : R/W; bitpos: [19:16]; default: 0;
 *  The total channel number of I2S TX TDM mode.
 */
#define I2S_TX_TDM_TOT_CHAN_NUM    0x0000000FU
#define I2S_TX_TDM_TOT_CHAN_NUM_M  (I2S_TX_TDM_TOT_CHAN_NUM_V << I2S_TX_TDM_TOT_CHAN_NUM_S)
#define I2S_TX_TDM_TOT_CHAN_NUM_V  0x0000000FU
#define I2S_TX_TDM_TOT_CHAN_NUM_S  16
/** I2S_TX_TDM_SKIP_MSK_EN : R/W; bitpos: [20]; default: 0;
 *  When DMA TX buffer stores the data of (REG_TX_TDM_TOT_CHAN_NUM + 1)  channels, and
 *  only the data of the enabled channels is sent, then this bit should be set. Clear
 *  it when all the data stored in DMA TX buffer is for enabled channels.
 */
#define I2S_TX_TDM_SKIP_MSK_EN    (BIT(20))
#define I2S_TX_TDM_SKIP_MSK_EN_M  (I2S_TX_TDM_SKIP_MSK_EN_V << I2S_TX_TDM_SKIP_MSK_EN_S)
#define I2S_TX_TDM_SKIP_MSK_EN_V  0x00000001U
#define I2S_TX_TDM_SKIP_MSK_EN_S  20

/** I2S_RX_TIMING_REG register
 *  I2S RX timing control register
 */
#define I2S_RX_TIMING_REG(i) (REG_I2S_BASE(i) + 0x58)
/** I2S_RX_SD_IN_DM : R/W; bitpos: [1:0]; default: 0;
 *  The delay mode of I2S Rx SD input signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_RX_SD_IN_DM    0x00000003U
#define I2S_RX_SD_IN_DM_M  (I2S_RX_SD_IN_DM_V << I2S_RX_SD_IN_DM_S)
#define I2S_RX_SD_IN_DM_V  0x00000003U
#define I2S_RX_SD_IN_DM_S  0
/** I2S_RX_WS_OUT_DM : R/W; bitpos: [17:16]; default: 0;
 *  The delay mode of I2S Rx WS output signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_RX_WS_OUT_DM    0x00000003U
#define I2S_RX_WS_OUT_DM_M  (I2S_RX_WS_OUT_DM_V << I2S_RX_WS_OUT_DM_S)
#define I2S_RX_WS_OUT_DM_V  0x00000003U
#define I2S_RX_WS_OUT_DM_S  16
/** I2S_RX_BCK_OUT_DM : R/W; bitpos: [21:20]; default: 0;
 *  The delay mode of I2S Rx BCK output signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_RX_BCK_OUT_DM    0x00000003U
#define I2S_RX_BCK_OUT_DM_M  (I2S_RX_BCK_OUT_DM_V << I2S_RX_BCK_OUT_DM_S)
#define I2S_RX_BCK_OUT_DM_V  0x00000003U
#define I2S_RX_BCK_OUT_DM_S  20
/** I2S_RX_WS_IN_DM : R/W; bitpos: [25:24]; default: 0;
 *  The delay mode of I2S Rx WS input signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_RX_WS_IN_DM    0x00000003U
#define I2S_RX_WS_IN_DM_M  (I2S_RX_WS_IN_DM_V << I2S_RX_WS_IN_DM_S)
#define I2S_RX_WS_IN_DM_V  0x00000003U
#define I2S_RX_WS_IN_DM_S  24
/** I2S_RX_BCK_IN_DM : R/W; bitpos: [29:28]; default: 0;
 *  The delay mode of I2S Rx BCK input signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_RX_BCK_IN_DM    0x00000003U
#define I2S_RX_BCK_IN_DM_M  (I2S_RX_BCK_IN_DM_V << I2S_RX_BCK_IN_DM_S)
#define I2S_RX_BCK_IN_DM_V  0x00000003U
#define I2S_RX_BCK_IN_DM_S  28

/** I2S_TX_TIMING_REG register
 *  I2S TX timing control register
 */
#define I2S_TX_TIMING_REG(i) (REG_I2S_BASE(i) + 0x5c)
/** I2S_TX_SD_OUT_DM : R/W; bitpos: [1:0]; default: 0;
 *  The delay mode of I2S TX SD output signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_TX_SD_OUT_DM    0x00000003U
#define I2S_TX_SD_OUT_DM_M  (I2S_TX_SD_OUT_DM_V << I2S_TX_SD_OUT_DM_S)
#define I2S_TX_SD_OUT_DM_V  0x00000003U
#define I2S_TX_SD_OUT_DM_S  0
/** I2S_TX_SD1_OUT_DM : R/W; bitpos: [5:4]; default: 0;
 *  The delay mode of I2S TX SD1 output signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_TX_SD1_OUT_DM    0x00000003U
#define I2S_TX_SD1_OUT_DM_M  (I2S_TX_SD1_OUT_DM_V << I2S_TX_SD1_OUT_DM_S)
#define I2S_TX_SD1_OUT_DM_V  0x00000003U
#define I2S_TX_SD1_OUT_DM_S  4
/** I2S_TX_WS_OUT_DM : R/W; bitpos: [17:16]; default: 0;
 *  The delay mode of I2S TX WS output signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_TX_WS_OUT_DM    0x00000003U
#define I2S_TX_WS_OUT_DM_M  (I2S_TX_WS_OUT_DM_V << I2S_TX_WS_OUT_DM_S)
#define I2S_TX_WS_OUT_DM_V  0x00000003U
#define I2S_TX_WS_OUT_DM_S  16
/** I2S_TX_BCK_OUT_DM : R/W; bitpos: [21:20]; default: 0;
 *  The delay mode of I2S TX BCK output signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_TX_BCK_OUT_DM    0x00000003U
#define I2S_TX_BCK_OUT_DM_M  (I2S_TX_BCK_OUT_DM_V << I2S_TX_BCK_OUT_DM_S)
#define I2S_TX_BCK_OUT_DM_V  0x00000003U
#define I2S_TX_BCK_OUT_DM_S  20
/** I2S_TX_WS_IN_DM : R/W; bitpos: [25:24]; default: 0;
 *  The delay mode of I2S TX WS input signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_TX_WS_IN_DM    0x00000003U
#define I2S_TX_WS_IN_DM_M  (I2S_TX_WS_IN_DM_V << I2S_TX_WS_IN_DM_S)
#define I2S_TX_WS_IN_DM_V  0x00000003U
#define I2S_TX_WS_IN_DM_S  24
/** I2S_TX_BCK_IN_DM : R/W; bitpos: [29:28]; default: 0;
 *  The delay mode of I2S TX BCK input signal. 0: bypass. 1: delay by pos edge.  2:
 *  delay by neg edge. 3: not used.
 */
#define I2S_TX_BCK_IN_DM    0x00000003U
#define I2S_TX_BCK_IN_DM_M  (I2S_TX_BCK_IN_DM_V << I2S_TX_BCK_IN_DM_S)
#define I2S_TX_BCK_IN_DM_V  0x00000003U
#define I2S_TX_BCK_IN_DM_S  28

/** I2S_LC_HUNG_CONF_REG register
 *  I2S HUNG configure register.
 */
#define I2S_LC_HUNG_CONF_REG(i) (REG_I2S_BASE(i) + 0x60)
/** I2S_LC_FIFO_TIMEOUT : R/W; bitpos: [7:0]; default: 16;
 *  the i2s_tx_hung_int interrupt or the i2s_rx_hung_int interrupt will be triggered
 *  when fifo hung counter is equal to this value
 */
#define I2S_LC_FIFO_TIMEOUT    0x000000FFU
#define I2S_LC_FIFO_TIMEOUT_M  (I2S_LC_FIFO_TIMEOUT_V << I2S_LC_FIFO_TIMEOUT_S)
#define I2S_LC_FIFO_TIMEOUT_V  0x000000FFU
#define I2S_LC_FIFO_TIMEOUT_S  0
/** I2S_LC_FIFO_TIMEOUT_SHIFT : R/W; bitpos: [10:8]; default: 0;
 *  The bits are used to scale tick counter threshold. The tick counter is reset when
 *  counter value >= 88000/2^i2s_lc_fifo_timeout_shift
 */
#define I2S_LC_FIFO_TIMEOUT_SHIFT    0x00000007U
#define I2S_LC_FIFO_TIMEOUT_SHIFT_M  (I2S_LC_FIFO_TIMEOUT_SHIFT_V << I2S_LC_FIFO_TIMEOUT_SHIFT_S)
#define I2S_LC_FIFO_TIMEOUT_SHIFT_V  0x00000007U
#define I2S_LC_FIFO_TIMEOUT_SHIFT_S  8
/** I2S_LC_FIFO_TIMEOUT_ENA : R/W; bitpos: [11]; default: 1;
 *  The enable bit for FIFO timeout
 */
#define I2S_LC_FIFO_TIMEOUT_ENA    (BIT(11))
#define I2S_LC_FIFO_TIMEOUT_ENA_M  (I2S_LC_FIFO_TIMEOUT_ENA_V << I2S_LC_FIFO_TIMEOUT_ENA_S)
#define I2S_LC_FIFO_TIMEOUT_ENA_V  0x00000001U
#define I2S_LC_FIFO_TIMEOUT_ENA_S  11

/** I2S_RXEOF_NUM_REG register
 *  I2S RX data number control register.
 */
#define I2S_RXEOF_NUM_REG(i) (REG_I2S_BASE(i) + 0x64)
/** I2S_RX_EOF_NUM : R/W; bitpos: [11:0]; default: 64;
 *  The receive data bit length is (I2S_RX_BITS_MOD[4:0] + 1) * (REG_RX_EOF_NUM[11:0] +
 *  1) . It will trigger in_suc_eof interrupt in the configured DMA RX channel.
 */
#define I2S_RX_EOF_NUM    0x00000FFFU
#define I2S_RX_EOF_NUM_M  (I2S_RX_EOF_NUM_V << I2S_RX_EOF_NUM_S)
#define I2S_RX_EOF_NUM_V  0x00000FFFU
#define I2S_RX_EOF_NUM_S  0

/** I2S_CONF_SIGLE_DATA_REG register
 *  I2S signal data register
 */
#define I2S_CONF_SIGLE_DATA_REG(i) (REG_I2S_BASE(i) + 0x68)
/** I2S_SINGLE_DATA : R/W; bitpos: [31:0]; default: 0;
 *  The configured constant channel data to be sent out.
 */
#define I2S_SINGLE_DATA    0xFFFFFFFFU
#define I2S_SINGLE_DATA_M  (I2S_SINGLE_DATA_V << I2S_SINGLE_DATA_S)
#define I2S_SINGLE_DATA_V  0xFFFFFFFFU
#define I2S_SINGLE_DATA_S  0

